In [1]:
import numpy as np
import pandas as pd

In [2]:
# 引入几个示例数据方便展现用法
index = pd.date_range("3/29/2022", periods=8)

s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
print(s)

df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=["A", "B", "C"])
df

a    1.836524
b    0.100053
c   -2.810627
d   -0.459612
e   -0.341241
dtype: float64

                   A         B         C
2022-03-29 -0.064871  1.255474 -0.543728
2022-03-30  1.071740  1.736349  0.529423
2022-03-31 -0.231623  0.903352  0.067332
2022-04-01  0.261749  1.327111  1.215027
2022-04-02 -1.300953  0.930358 -0.159610
2022-04-03  2.460079  0.401170 -1.729134
2022-04-04  0.164483 -1.665924  0.724465
2022-04-05  1.517540  0.362927 -0.840430

# head( ) 和 tail( )
To view a small sample of a `Series` or `DataFrame` object, use the head() and tail() methods. The default number of elements to display is five, but you may pass a custom number.

In [3]:
long_series = pd.Series(np.random.randn(1000))
long_series.head()  # 默认显示头部五个数据

0    0.379024
1   -0.548118
2    0.353752
3    1.277910
4    0.658308
dtype: float64

In [4]:
long_series.head(10)  # 自定义显示头部的数据的个数

0    0.379024
1   -0.548118
2    0.353752
3    1.277910
4    0.658308
5    0.076569
6   -1.693582
7   -0.103329
8    0.510302
9    0.387641
dtype: float64

In [5]:
long_series.tail()  # 默认显示尾部五个数据

995    0.482874
996   -1.103589
997    0.699285
998   -0.017762
999    1.489711
dtype: float64

In [6]:
long_series.tail(10)  # 自定义显示尾部的数据的个数

990    0.350158
991    0.337834
992   -0.176669
993   -1.422624
994   -0.045020
995    0.482874
996   -1.103589
997    0.699285
998   -0.017762
999    1.489711
dtype: float64

# attributes and underlying data  属性和底层数据

In [7]:
df

                   A         B         C
2022-03-29 -0.064871  1.255474 -0.543728
2022-03-30  1.071740  1.736349  0.529423
2022-03-31 -0.231623  0.903352  0.067332
2022-04-01  0.261749  1.327111  1.215027
2022-04-02 -1.300953  0.930358 -0.159610
2022-04-03  2.460079  0.401170 -1.729134
2022-04-04  0.164483 -1.665924  0.724465
2022-04-05  1.517540  0.362927 -0.840430

In [8]:
df[:3]

                   A         B         C
2022-03-29 -0.064871  1.255474 -0.543728
2022-03-30  1.071740  1.736349  0.529423
2022-03-31 -0.231623  0.903352  0.067332

In [9]:
df.columns = [x.lower() for x in df.columns]

In [10]:
df

                   a         b         c
2022-03-29 -0.064871  1.255474 -0.543728
2022-03-30  1.071740  1.736349  0.529423
2022-03-31 -0.231623  0.903352  0.067332
2022-04-01  0.261749  1.327111  1.215027
2022-04-02 -1.300953  0.930358 -0.159610
2022-04-03  2.460079  0.401170 -1.729134
2022-04-04  0.164483 -1.665924  0.724465
2022-04-05  1.517540  0.362927 -0.840430

In [11]:
df.columns = [9, 'you', '88']
df

                   9       you        88
2022-03-29 -0.064871  1.255474 -0.543728
2022-03-30  1.071740  1.736349  0.529423
2022-03-31 -0.231623  0.903352  0.067332
2022-04-01  0.261749  1.327111  1.215027
2022-04-02 -1.300953  0.930358 -0.159610
2022-04-03  2.460079  0.401170 -1.729134
2022-04-04  0.164483 -1.665924  0.724465
2022-04-05  1.517540  0.362927 -0.840430

In [12]:
s

a    1.836524
b    0.100053
c   -2.810627
d   -0.459612
e   -0.341241
dtype: float64

In [13]:
# 将 s 转换为 NumPy array
s.to_numpy()

array([ 1.83652444,  0.10005327, -2.8106267 , -0.45961169, -0.3412408 ])

In [14]:
# 或者使用 asarray( ) 方法
np.asarray(s)

array([ 1.83652444,  0.10005327, -2.8106267 , -0.45961169, -0.3412408 ])

In [15]:
df

                   9       you        88
2022-03-29 -0.064871  1.255474 -0.543728
2022-03-30  1.071740  1.736349  0.529423
2022-03-31 -0.231623  0.903352  0.067332
2022-04-01  0.261749  1.327111  1.215027
2022-04-02 -1.300953  0.930358 -0.159610
2022-04-03  2.460079  0.401170 -1.729134
2022-04-04  0.164483 -1.665924  0.724465
2022-04-05  1.517540  0.362927 -0.840430

In [16]:
# When your DataFrame only has a single data type for all the columns, DataFrame.to_numpy() will return the underlying data.
# 将 df 转换为 NumPy array
df.to_numpy()

array([[-0.06487059,  1.25547363, -0.54372791],
       [ 1.07173965,  1.73634924,  0.52942288],
       [-0.23162281,  0.90335196,  0.06733228],
       [ 0.26174889,  1.32711075,  1.21502656],
       [-1.30095289,  0.93035844, -0.1596101 ],
       [ 2.4600786 ,  0.40117045, -1.72913352],
       [ 0.16448266, -1.66592405,  0.72446482],
       [ 1.51754008,  0.36292662, -0.8404299 ]])

# matching / broadcasting behavior   匹配行为 / 广播行为

In [17]:
df = pd.DataFrame(
    {
        "one": pd.Series(np.arange(3, 6), index=["a", "b", "c"]),
        "two": pd.Series(np.arange(7, 11), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.arange(3), index=["b", "c", "d"]),
    }
)

df

   one  two  three
a  3.0    7    NaN
b  4.0    8    0.0
c  5.0    9    1.0
d  NaN   10    2.0

In [18]:
selected_row = df.iloc[1]
print(selected_row)

print('-'*30)

selected_column = df["two"]
print(selected_column)

one      4.0
two      8.0
three    0.0
Name: b, dtype: float64
------------------------------
a     7
b     8
c     9
d    10
Name: two, dtype: int32

### [🧐***参考博客***](https://blog.csdn.net/wyf2017/article/details/107459509)
---
![](https://img-blog.csdnimg.cn/20200720111708736.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L3d5ZjIwMTc=,size_16,color_FFFFFF,t_70)

In [19]:
#  第一列的第一个、第二列的第一个、第三列的第一个     去减    selected_row
#  第一列的第二个、第二列的第二个、第三列的第二个     去减    selected_row
#  第一列的第三个、第二列的第三个、第三列的第三个     去减    selected_row
df.sub(selected_row, axis="columns")

   one  two  three
a -1.0 -1.0    NaN
b  0.0  0.0    0.0
c  1.0  1.0    1.0
d  NaN  2.0    2.0

In [20]:
df.sub(selected_row, axis=1)

   one  two  three
a -1.0 -1.0    NaN
b  0.0  0.0    0.0
c  1.0  1.0    1.0
d  NaN  2.0    2.0

In [21]:
#  第一行的第一个、第二行的第一个、第三行的第一个     去减    selected_column
#  第一行的第二个、第二行的第二个、第三行的第二个     去减    selected_column
#  第一行的第三个、第二行的第三个、第三行的第三个     去减    selected_column
df.sub(selected_column, axis="index")

   one  two  three
a -4.0    0    NaN
b -4.0    0   -8.0
c -4.0    0   -8.0
d  NaN    0   -8.0

In [22]:
df.sub(selected_column, axis=0)

   one  two  three
a -4.0    0    NaN
b -4.0    0   -8.0
c -4.0    0   -8.0
d  NaN    0   -8.0

# Comparing if objects are equivalent

In [23]:
df1 = pd.DataFrame({"col": ["foo", 0, np.nan]})
df1

   col
0  foo
1    0
2  NaN

In [24]:
df2 = pd.DataFrame({"col": [np.nan, 0, "foo"]}, index=[2, 1, 0])
df2

   col
2  NaN
1    0
0  foo

#### 😴Note that the Series or DataFrame index needs to be in the same order for equality to be True:

In [25]:
df1.equals(df2)

False

In [26]:
df2.sort_index()

   col
0  foo
1    0
2  NaN

In [27]:
df1.equals(df2.sort_index())

True

# Index of min/max values
The idxmin() and idxmax() functions on Series and DataFrame compute the index labels with the minimum and maximum corresponding values.

In [28]:
s1 = pd.Series([2, 6, 8, -3, -10])
s1.dtype

dtype('int64')

In [29]:
s1.idxmin()

4

In [30]:
s1.idxmax()

2

In [31]:
df1 = pd.DataFrame([[2, -3, 8, 4], [9, 30, -100, 35], [23, 43, -33, -66], [423, 9, -3, -88]], columns=['you', 'and', 'me', 'forever'])
df1

   you  and   me  forever
0    2   -3    8        4
1    9   30 -100       35
2   23   43  -33      -66
3  423    9   -3      -88

In [32]:
df1.idxmin(axis='index')

you        0
and        0
me         1
forever    3
dtype: int64

In [33]:
df1.idxmin(axis=0)

you        0
and        0
me         1
forever    3
dtype: int64

In [34]:
df1.idxmax(axis='columns')

0         me
1    forever
2        and
3        you
dtype: object

In [35]:
df1.idxmax(axis=1)

0         me
1    forever
2        and
3        you
dtype: object

# Mixed dtypes &nbsp;&nbsp;&nbsp;混合数据类型

In [36]:
mdf = pd.DataFrame(
    {
        "A": [1, 2, 3],
        "B": [1.0, 2.0, 3.0],
        "C": ["foo", "bar", "baz"],
        "D": pd.date_range("20130101", periods=3),
    }
)

mdf

   A    B    C          D
0  1  1.0  foo 2013-01-01
1  2  2.0  bar 2013-01-02
2  3  3.0  baz 2013-01-03

In [37]:
mdf.dtypes

A             int64
B           float64
C            object
D    datetime64[ns]
dtype: object

In [38]:
mdf.agg(["min", "sum"])

     A    B          C          D
min  1  1.0        bar 2013-01-01
sum  6  6.0  foobarbaz        NaT

# Transform API

In [45]:
tsdf = pd.DataFrame(
    np.random.randint(-30, 20, size=(10, 3)),
    columns=["A", "B", "C"],
    index=pd.date_range("3/30/2022", periods=10),
)
tsdf

             A   B   C
2022-03-30 -20   5 -15
2022-03-31  -4  12  13
2022-04-01 -11 -19  -5
2022-04-02  -4 -24 -12
2022-04-03 -20  11   0
2022-04-04 -17 -14  17
2022-04-05  13  15   8
2022-04-06   6   6   8
2022-04-07 -28  14 -27
2022-04-08 -13  18   0

In [46]:
tsdf.iloc[3]

A    -4
B   -24
C   -12
Name: 2022-04-02 00:00:00, dtype: int32

In [47]:
tsdf.iloc[3:7]

             A   B   C
2022-04-02  -4 -24 -12
2022-04-03 -20  11   0
2022-04-04 -17 -14  17
2022-04-05  13  15   8

In [48]:
tsdf[3:7]

             A   B   C
2022-04-02  -4 -24 -12
2022-04-03 -20  11   0
2022-04-04 -17 -14  17
2022-04-05  13  15   8

In [49]:
tsdf.loc['2022-04-01']

A   -11
B   -19
C    -5
Name: 2022-04-01 00:00:00, dtype: int32

In [50]:
tsdf[3:7] = np.nan
tsdf

               A     B     C
2022-03-30 -20.0   5.0 -15.0
2022-03-31  -4.0  12.0  13.0
2022-04-01 -11.0 -19.0  -5.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06   6.0   6.0   8.0
2022-04-07 -28.0  14.0 -27.0
2022-04-08 -13.0  18.0   0.0

#### 😎Transform the entire frame. .transform() allows input functions as: a NumPy function, a string function name or a user defined function.

In [52]:
tsdf.transform(np.abs)

               A     B     C
2022-03-30  20.0   5.0  15.0
2022-03-31   4.0  12.0  13.0
2022-04-01  11.0  19.0   5.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06   6.0   6.0   8.0
2022-04-07  28.0  14.0  27.0
2022-04-08  13.0  18.0   0.0

In [59]:
tsdf.transform('abs')

               A     B     C
2022-03-30  20.0   5.0  15.0
2022-03-31   4.0  12.0  13.0
2022-04-01  11.0  19.0   5.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06   6.0   6.0   8.0
2022-04-07  28.0  14.0  27.0
2022-04-08  13.0  18.0   0.0

In [61]:
tsdf.transform(lambda x: abs(x))

               A     B     C
2022-03-30  20.0   5.0  15.0
2022-03-31   4.0  12.0  13.0
2022-04-01  11.0  19.0   5.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06   6.0   6.0   8.0
2022-04-07  28.0  14.0  27.0
2022-04-08  13.0  18.0   0.0

In [62]:
np.abs(tsdf)

               A     B     C
2022-03-30  20.0   5.0  15.0
2022-03-31   4.0  12.0  13.0
2022-04-01  11.0  19.0   5.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06   6.0   6.0   8.0
2022-04-07  28.0  14.0  27.0
2022-04-08  13.0  18.0   0.0

In [64]:
tsdf["A"].transform('abs')

2022-03-30    20.0
2022-03-31     4.0
2022-04-01    11.0
2022-04-02     NaN
2022-04-03     NaN
2022-04-04     NaN
2022-04-05     NaN
2022-04-06     6.0
2022-04-07    28.0
2022-04-08    13.0
Freq: D, Name: A, dtype: float64

## Transform with multiple functions
Passing multiple functions will yield a column MultiIndexed DataFrame. The first level will be the original frame column names; the second level will be the names of the transforming functions.

In [67]:
tsdf.transform([np.abs, lambda x: x + 1000])

                  A                 B                 C
           absolute <lambda> absolute <lambda> absolute <lambda>
2022-03-30     20.0    980.0      5.0   1005.0     15.0    985.0
2022-03-31      4.0    996.0     12.0   1012.0     13.0   1013.0
2022-04-01     11.0    989.0     19.0    981.0      5.0    995.0
2022-04-02      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-03      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-04      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-05      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-06      6.0   1006.0      6.0   1006.0      8.0   1008.0
2022-04-07     28.0    972.0     14.0   1014.0     27.0    973.0
2022-04-08     13.0    987.0     18.0   1018.0      0.0   1000.0

In [68]:
tsdf.transform([np.abs, lambda x: x + 1000]).columns

MultiIndex([('A', 'absolute'),
            ('A', '<lambda>'),
            ('B', 'absolute'),
            ('B', '<lambda>'),
            ('C', 'absolute'),
            ('C', '<lambda>')],
           )